var day_i;
const prediciton = ["Кицю, от тепер ти і став  ̶с̶т̶а̶р̶и̶м̶ дорослим! :) За ці 18 років ти багато чого вже зробив та досяг (більше, ніж більшість людей зроблять за все своє життя), але я знаю, що ти навіть не думаєш здаватись.  Це правильно. Я не моду уявити що було б зі мною, якби я тебе не зустріла більше ніж два роки тому у Києві. І хоч у нас бувають дуже складні періоди, я неймовірно вдячна тобі за все, що ти для мене зробив і провожуєш робити. Я тебе неймовріно ціную, кохаю та поважаю. Сподіваюсь, що цей невеличкий подарунок зможе хоч трішки підняти тобі настрій! У мене ще є дущо для тебе, але це я зможу віддати лише тоді, коли зустріну тебе у реальному житті :) А поки, хочу побажати тобі натхнення, наснаги, здоров’я, любові, радощі та усього-усього найкращого! Я тебе кохаю. З твоїм днем, Васюню<3", "Я тебе безмежно кохаю, пам'ятаю це. Посміхайся. Радій. Смійся. Танцюй. Співай. Кохай. Насолоджуйся життям.", "Пам'ятай, що у тебе все вийде. Ти переможець! Гарного дня!", "До зустрічі, коханий, я писатиму, і ти мені пиши.❤️ ", "Уже мрію про наш багатомільйонний будинок і тваринок, яких ми будемо мати. Any ideas?:)"];

var today = new Date();

var date = (today.getMonth()+1)+'/'+today.getDate()+'/'+today.getFullYear();

function getNumberOfDays(end) {
    const date1 = new Date('1/14/2022')
    const date2 = new Date(end);

    // One day in milliseconds
    const oneDay = 1000 * 60 * 60 * 24;

    // Calculating the time difference between two dates
    const diffInTime = date2.getTime() - date1.getTime();

    // Calculating the no. of days between two dates
    const diffInDays = Math.round(diffInTime / oneDay);

    return diffInDays;
}

day_i = getNumberOfDays(date);


document.getElementById('wish').innerHTML = prediciton[day_i];
